----------------------------------------------------------------------------------

----------------------------------------------------------------------------------
local PushNotificationsManager = {
    _bOpenAPN = true,
    -- 是否开启推送通知： true 开启 false 关闭
    _SilenceCfg = { },
    _PushCfg = { },
    TaskTimeCalcultor = { },
}

PushNotificationsManager._SilenceCfg = {
    [1] =
    {
        _StartTime = { 0, 0, 0 },
        -- 推送静默时间 "00:00:00"
        _EndTime = { 6, 0, 0 },
        -- 推送静默时间 "06:00:00"
    },
    [2] =
    {
        _StartTime = { 22, 0, 0 },
        -- 推送静默时间 "22:00:00"
        _EndTime = { 23, 59, 59 },
        -- 推送静默时间 "23:59:59"
    }
}

PushNotificationsManager._PushCfg = {
    --[1] =
    --{
    --    _Id = 1,
    --    -- 推送ID
    --    _Type = 0,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_1.mp3",
    --    -- 语言资源
    --    _Text = "学妹们远足回来啦~快来看看大家带了什么礼物回来吧♥",
    --    -- 推送内容
    --    _minLevel = 1000,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { },
    --    -- 推送时间
    --    _DateStart = { 2037, 1, 1 },
    --    -- 推送开始日期 "2010-01-01"
    --    _DateEnd = { 2037, 12, 31 },
    --    -- 推送结束日期最多只能设置到 "2037-12-31"
    --},
    --[2] =
    --{
    --    _Id = 2,
    --    -- 推送ID
    --    _Type = 1,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_2.mp3",
    --    -- 语言资源
    --    _Text = "少东~奖励已经满出来了，赶快登入调教人家嘛♥",
    --    -- 推送内容
    --    _minLevel = 1000,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { },
    --    -- 推送时间
    --    _DateStart = { 2037, 1, 1 },
    --    -- 推送开始日期 "2010-01-01"
    --    _DateEnd = { 2037, 12, 31 },
    --    -- 推送结束日期最多只能设置到 "2037-12-31"
    --},
    --[3] =
    --{
    --    _Id = 3,
    --    -- 推送ID
    --    _Type = 3,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_3.mp3",
    --    -- 语言资源 张飞推送
    --    _Text = "郭嘉：「ハロウィンは仮装してチェスするのはいかがかしら？」",
    --    -- 推送内容
    --    _minLevel = 1,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 12, 5, 0 },
    --    -- 推送时间 "09:00:00"
    --    _DateStart = { 2019, 10, 28 },
    --    -- 推送开始日期 "2010-01-01"
    --    _DateEnd = { 2019, 10, 30 },
    --    -- 推送结束日期最多只能设置到 "2037-12-31"
    --},
    --[4] =
    --{
    --    _Id = 4,
    --    -- 推送ID
    --    _Type = 2,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_4.mp3",
    --    -- 语言资源 GVG 循环推送
    --    _Text = "そろそろ攻城の準備を！その前に一騎討ちの報酬も受け取ってね〜",
    --    -- 推送内容
    --    _minLevel = 1,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 20, 59, 0 },
    --    -- 推送时间 "21:00:00"
    --    _DateStart = { 2010, 1, 1 },
    --    -- 推送开始日期 "2010-01-01"
    --    _DateEnd = { 2010, 12, 31 },
    --    -- 推送结束日期最多只能设置到 "2037-12-31"
    --},
    --[5] =
    --{
    --    _Id = 5,
    --    -- 推送ID
    --    _Type = 2,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_5.mp3",
    --    -- 语言资源
    --    _Text = "世界BOSS即将开战，赶快登入凌辱BOOBS吧！",
    --    -- 推送内容
    --    _minLevel = 1,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 12, 28, 0 },
    --    -- 推送时间 "12:45:00"
    --    _DateStart = { 2037, 1, 1 },
    --    -- 推送开始日期 "2010-01-01"
    --    _DateEnd = { 2037, 12, 31 },
    --    -- 推送结束日期最多只能设置到 "2037-12-31"
    --},
    --[6] =
    --{
    --    _Id = 6,
    --    -- 推送ID
    --    _Type = 2,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_6.mp3",
    --    -- 语言资源
    --    _Text = "世界BOSS即将开战，赶快登入凌辱BOOBS吧！",
    --    -- 推送内容
    --    _minLevel = 1,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 19, 28, 0 },
    --    -- 推送时间 "19:45:00"
    --    _DateStart = { 2037, 1, 1 },
    --    -- 推送开始日期 "2010-01-01"
    --    _DateEnd = { 2037, 12, 31 },
    --    -- 推送结束日期最多只能设置到 "2037-12-31"
    --},
    --[7] =
    --{
    --    -- 花嫁道场 每日循环推送 19：44
    --    _Id = 7,
    --    -- 推送ID
    --    _Type = 2,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_7.mp3",
    --    -- 语言资源
    --    _Text = "体を鍛える時間だ！道場で待っているよ！",
    --    -- 推送内容
    --    _minLevel = 35,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 19, 44, 0 },
    --    -- 推送时间 "19:44:00"
    --    _DateStart = { 2010, 1, 1 },
    --    -- 推送开始日期 "2017-11-30"
    --    _DateEnd = { 2010, 12, 31 },
    --    -- 推送结束日期 "2017-12-07"
    --},
    --[8] =
    --{
    --    _Id = 8,
    --    -- 推送ID
    --    _Type = 3,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_7.mp3",
    --    -- 语言资源
    --    _Text = "卞氏翩然而至！主人，我好冷啊，温暖我一下吧！",
    --    -- 推送内容
    --    _minLevel = 1000,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 12, 30, 0 },
    --    -- 推送时间 "12:30:00"
    --    _DateStart = { 2017, 12, 4 },
    --    -- 推送开始日期 "2017-12-4"
    --    _DateEnd = { 2017, 12, 10 },
    --    -- 推送结束日期 "2017-12-10"
    --},
    --[9] =
    --{
    --    _Id = 9,
    --    -- 推送ID
    --    _Type = 3,
    --    -- 推送类型  0 副将游历任务完成时推送（推送时间_Time不填）、 1 离线时间超过24小时推送（推送时间_Time不填）、 2 循环推送、 3单次推送
    --    _Icon = "",
    --    -- 推送Icon
    --    _Sound = "push_7.mp3",
    --    -- 语言资源 关羽推送
    --    _Text = "諸葛瑾：「トリック・オア・トリート！遊んでくれないと悪戯するよ！」",
    --    -- 推送内容
    --    _minLevel = 1,
    --    -- 最低等级限制
    --    _maxLevel = 1000,
    --    -- 最高等级限制
    --    _Time = { 12, 5, 0 },
    --    -- 推送时间 "12:30:00"
    --    _DateStart = { 2019, 10, 31 },
    --    -- 推送开始日期 "2017-12-4"
    --    _DateEnd = { 2019, 11, 3 },
    --    -- 推送结束日期 "2017-12-10"
    --}
}

----------packet msg--------------------------
return PushNotificationsManager
